[
  {
    "text": "Wellspring installed beams on my 15 foot high vaulted ceiling.  I want to commend them for an awesome job and experience.  Their attention to detail and their personability was greatly appreciated.  I have owned a commercial general contracting business for over 33 years and have had experience with numerous subcontractors.  Wellspring Home Services is one of the best.",
    "name": "Marc Dewey"
  },
  {
    "text": "Brett and his crew are extremely reliable.  They listen and do excellent work that we want done as well as adding some innovative ideas to the projects.  We've used them at least 4 times and have completely satisfied each time.  I trust Brett and his crew.  He's an honest Christian man that provides great work at on honest price. ",
    "name": "Bryan Boswell"
  },
  {
    "text": "Brett and his team did a wonderful job of remodeling our bathroom which was quite a complicated project and we couldn't be happier.  They communicated well, showed up on time,  were always courteous and cheerful and open to any changes that needed to be made.  We really enjoyed having them work for us and would thoroughly recommend them.",
    "name": "Tricia Edridge"
  },
  {
    "text": "I regard Brett and his crew as top quality and value home construction remodelers, handymen, etc. \n Besides the major addition of a sunroom to our house (concrete, windows, framing, painting, flooring, insulation, electrical, etc.) they have done great small jobs for us (e.g., toilet and heated towel bar installation, wall repair, ceiling light installation and indoor painting).  They stand by their work and have done anything and everything to make it perfect.   I highly recommend Brett and his crew - they are honest and hard working and friendly/courteous.",
    "name": "Will Tracz"
  },
  {
    "text": "Brett and all of his guys did a fantastic job finishing our entire basement which included a bath, family room, art studio and bedroom.  They completed most of the project when we were still living in Illinois, so communication was of the utmost importance.  Brett kept us informed every step of the way with calls and pictures and never failed to promptly answer any questions or requests that we had. They were always patient, professional and respectful and we couldn't be happier with the finished product!  We highly recommend Wellspring. Thanks, guys!",
    "name": "Mikki Grant"
  },
  {
    "text": "Brett and his guys did an awesome job working on my latest home renovation project. After 2 contractors failed to show, I gave Brett a call. He immediately responded and scheduled a visit to check out the job: lowering 2 nearly 10ft door openings to accommodate 9ft tall barn doors. Brett and his crew were professional, courteous, and completed the job start to finish: framing, adding a header for each door, drywalling, matching texture, painting, and clean up.  I would recommend Wellspring Home Services.",
    "name": "Lesly McRae"
  },
  {
    "text": "Amazing work done by Wellspring home services! Our kitchen is perfect.",
    "name": "Cody Niccoli"
  },
  {
    "text": "Very professional.  Nice friendly staff.  I would recommend Wellspring Home Services highly! A++++!!!!",
    "name": "Alan Skowron"
  },
  {
    "text": "Brett and his team completely reconstructed one bathroom shower. On another job they painted walls and trim. They are all GREAT to have in my home.",
    "name": "Terri Marone"
  },
  {
    "text": "We have been working with Brett and his team for many years (for personal and business projects). Highly recommended. Conscientious. Fair. Professional. Integrous. Trustworthy.",
    "name": "Jeff Bristol"
  },
  {
    "text": "I was referred to Wellspring Construction thru a family member. I called Brett as I needed a strong carport built. He quoted me a price. Him and his crew had my carport up on no time. They were polite, on time daily and was respectful to me and  my property. I had one small problem during a wind storm. Called Brett and told him what was going on. Within a short time the same day he had it fixed. I am very happy with my carport. He does great work.",
    "name": "Terri Boden"
  },
  {
    "text": "Wellspring renovated my house and replaced my kitchen.  That double oven is a blessing!  We had family over the day before Thanksgiving and baked all day.  9 people and we were able to bake without stepping on each other.",
    "name": "Sara Armstrong"
  },
  {
    "text": "Brett and Jordan were excellent to work with. Professional, clean, on time, helpful.  From the bringing of the painting experience I enjoyed working with them to the final product.  Thank you!",
    "name": "Joelle Benson"
  },
  {
    "text": "Our family couldn’t have been more pleased with Wellspring ! Not only do they do best quality work, they all have awesome attitudes! We had a budget and Brett worked to help our family stay within our financial limits. Zach, Jordan, and Brett finished work is above and beyond what we couldn’t ask and prayed for! We recommend Wellspring for honest and great quality work !",
    "name": "Laris Ryd"
  },
  {
    "text": "Brett and the crew were great. Not only did they do amazing work, they were so respectful of my wife and young children. I will absolutely work with them again.",
    "name": "Joshua Amundson"
  }
]
